app/Http/Controllers/Api/CategoryController.php

    public function index(Request $request)
    {
        $categories = Category::where([['status', 1], ['level', "<=", 2]])
            ->get();
---
select * from `categories` where (`status` = 1 and `level` <= 2)