app/Http/Controllers/Api/CompanyController.php

select * from `companies` where `domain` = 'asperiores.fr' limit 1
---
    public function index(Request $request, $domain)
    {
        $domain = preg_replace("~^www\.~", "", $domain);
        $company = Company::where("domain", $domain)->with(['information'])->first();

select * from `companies` where `domain` = 'asperiores.fr' limit 1
select * from `reviews` where `company_id` = 9 order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `reviews` where `company_id` = 9
---
    public function reviews(Request $request, $domain)
    {
        $domain = preg_replace("~^www\.~", "", $domain);
        $company = Company::where("domain", $domain)->first();
        if (empty($company)) abort(404);

        $query = Review::with(['author:id,first_name,last_name', 'reply'])
            ->where('company_id', $company->id);

        $search = $request->get('search');
        if (!empty($search)) {
            $query->where(function ($q) use ($search) {
                $q->where('title', 'like', "%$search%")->orWhere('content', 'like', "%$search%");
            });
        }

        $stars = $request->get('stars');
        if (!empty($stars)) {
            if (is_array($stars)) $query->whereIn('rating', $stars);
            else $query->where('rating', $stars);
        }
        $query->orderBy('created_at', 'desc');

        $reviews = $query->paginate(5);

select * from `companies` where `uuid` = '70d3c6d2-5c79-4798-86c7-63ac34f4e6fd' limit 1
select `rating`, count(*) as count from `reviews` where `company_id` = 9 group by `rating`
select count(*) as aggregate from `reviews` where `company_id` = 9
---
    public function info(Request $request, $uuid)
    {
        $company = Company::where('uuid', $uuid)->first();
        if (empty($company)) abort(404);

        $query = Review::where('company_id', $company->id);
        $reviews_count = $query->count();
        $average_rating = $query->avg('rating');
        $stars = $query->select(['rating', DB::raw('count(*) as count')])->groupBy('rating')->get()->pluck('count', 'rating')->all();