app/Http/Controllers/Api/ReviewController.php

select * from `reviews` order by `created_at` desc limit 12
select `id`, `domain`, `name` from `companies` where `companies`.`id` in (11, 18, 43, 56, 58, 59, 66, 72, 84, 89, 98)
---
    public function recent(Request $request)
    {
        $reviews = Review::with([
            'author:id,first_name,last_name',
            'company:id,domain,name'
        ])->orderBy('created_at', 'desc')->limit(12)->get();