app/Http/Controllers/Api/SearchController.php

    public function suggestion(Request $request)
    {
        $results = [];
        $query = $request->get('query', '');
        if (!empty($query)) {
            $results['companies'] = Company::where("domain", "like", "%$query%")
                                ->limit(5)->get();
---
select * from `companies` where `domain` like '%fr%' limit 5