app/Http/Controllers/Api/UserController.php

    public function login(Request $request)
    {
        $facebook_token = $request->post('facebook');
        $google_token = $request->post('google');

        $query = [];
        if (!empty($facebook_token)) $query['facebook'] = $facebook_token;
        else if (!empty($google_token)) $query['google'] = $google_token;
        $client = new \GuzzleHttp\Client();
        try {
            $response = $client->get('https://web-dev.spiking.com/oauth', ['query' => $query]);
            $data = json_decode($response->getBody()->getContents(), true);
            if (!empty($data['data']['access_token'])) {
                $response = $client->get('https://api-dev.spiking.com/v3/me', ['query' => ['access_token' => $data['data']['access_token']]]);
                $data = json_decode($response->getBody()->getContents(), true);
                $user = User::where('spiking_id', $data['Id'])->first();
                if (empty($user)) {
                    $user = new User();
                    $user->spiking_id = $data['Id'];
                    $user->first_name = $data['Firstname'];
                    $user->last_name = $data['Lastname'];
                    $user->email = $data['Email'];
                    $user->password = Hash::make('password');
                    $user->save();
---
select * from `users` where `spiking_id` = '80206' limit 1
insert into `users` (`spiking_id`, `first_name`, `last_name`, `email`, `password`, `uuid`, `updated_at`, `created_at`) values ('80206', 'Kiên', 'Đặng', 'dangtrungkien96@gmail.com', 'y$UPTLZSoMBJFe.RrBLX8Rr.vum3X7QbTYAzqLepSBjgWrwR/a6JQ6O', '8a98d263-24f8-4d95-b793-5ed2ed5380ea', '2021-06-21 16:46:52', '2021-06-21 16:46:52')