app/Http/Controllers/Api/Admin/CategoryController.php

update `categories` set `depth` = 1, `categories`.`updated_at` = '2021-06-21 14:11:18' where `id` = 1
---
    public function _updateParent($id, $parent_id = 0) {
        $categoryModel  = Category::find($id);
        if ($parent_id == 0) {
            $categoryModel->depth = $id;
        } else {
            $categoryParent       = Category::find($parent_id);
            $categoryModel->depth = $categoryParent->depth."/".$id;
        }
        $categoryModel->save();