app/Http/Controllers/Api/Admin/CategoryController.php

select * from `categories` where `level` <= '3' order by `depth` asc
---
    public function index(Request $request)
    {
        $level = $request->input('level', '3');

        $category_id = $request->input('category_id', null);

        $categoryModel = Category::where('level', "<=", $level);

        if ($category_id) {
            $categoryModel->where('id', '!=', $category_id);
            $categoryModel->where('parent_id', '!=', $category_id);
        }
        if ($level != 3) {
            $categoryModel->with('children')
                ->with('parent');
        }

        $categories = $categoryModel ->orderBy('depth', 'asc')->get();

insert into `categories` (`parent_id`, `status`, `name`, `slug`, `created_by`, `updated_by`, `updated_at`, `created_at`) values ('0', 1, 'Food, Beverages & Tobacco', 'food-beverages-tobacco', 11, 11, '2021-06-21 14:11:18', '2021-06-21 14:11:18')
---
    public function store(Request $request)
    {
        $validate = $this->_validate($request->all());
        if ($validate->fails()) {
            return response()->json($validate->errors(), 400);
        }
        $user = $request->user();
        DB::beginTransaction();
        try {
            $category = new Category();
            $category->parent_id = $request->parent_id;
            $category->status = $request->status;
            $category->name = $request->name;
            $category->slug = Str::slug($request->name);
            $category->created_by = $user->id;

update `categories` set `depth` = '1/4', `level` = 2, `categories`.`updated_at` = '2021-06-21 14:15:15' where `id` = 4
---
    public function _updateParent($id, $parent_id = 0)
    {
        $categoryModel = Category::find($id);

        if ($parent_id == 0) {
            $categoryModel->depth = $id;
            $categoryModel->level = 1;
        } else {
            $categoryParent = Category::find($parent_id);
            $categoryModel->depth = $categoryParent->depth . "/" . $id;
            $categoryModel->level = count(explode('/', $categoryModel->depth));
        }
        $categoryModel->save();