app/Http/Controllers/Api/Admin/CompanyController.php

select * from `companies` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `companies`
---
    public function index(Request $request)
    {
        $perPage = $request->input('prePage', 20);

        $companies = Company::orderByDesc('created_at')
            ->paginate($perPage);