app/Http/Controllers/Api/Admin/MailController.php

    public function index(Request $request)
    {
        $settings = Setting::where('type', Setting::MAIL_SETTINGS)->get();
---
select * from `settings` where `type` = 'MAIL_SETTINGS'