app/Http/Controllers/Api/Admin/ReviewController.php

    public function index(Request $request)
    {
        $perPage = $request->input('prePage', 20);

        $reviews = Review::with('company')
            ->orderByDesc('created_at')
            ->paginate($perPage);
---
select * from `companies` where `companies`.`id` in (11, 18, 33, 35, 43, 48, 49, 56, 58, 59, 66, 69, 72, 77, 84, 89, 95, 98, 100)
select * from `reviews` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `reviews`

    public function destroy($id) {
        $review  = Review::find($id);
        $review->delete();
---
delete from `reviews` where `id` = 769