app/Http/Controllers/Api/Admin/UserController.php

select * from `users` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `users`
---
    public function index(Request $request)
    {
        $perPage = $request->input('prePage', 20);

        $users = User::with('companies')
                        ->orderByDesc('created_at')
                        ->paginate($perPage);